{
    "pageTitle": "Sobre - Pietro Bondioli",
    "pageDescription": "Conhecimentos - Educação - Experiência",
    "skills": {
        "title": "skills",
        "sections": {
            "programming_languages": {
                "title": "programming languages"
            },
            "frameworks": {
                "title": "frameworks"
            },
            "tools": {
                "title": "tools"
            },
            "others": {
                "title": "others"
            }
        }
    },
    "experience": {
        "title": "experiência",
        "items": [
            {
                "name": "Take Blip",
                "position": "Engenheiro de Software Full Stack",
                "stack": "C# | .NET | Typescript | ReactJS | NestJS | Docker | Software Architecture | Chatbots",
                "description": "• Desenvolvi e integrei APIs REST para grandes clientes como Dell, Netflix, Nestlé, Vale e Petrobrás, lidando com milhares de solicitações por segundo.\n• Contribuições-chave para chatbots gerando mais de 1M em receita dentro de uma semana após o lançamento.\n• Implementei mais de 60 soluções robustas usando C#, .NET Core, NodeJS, ReactJS, Azure Devops, Docker e Kubernetes, atendendo a requisitos de projetos diversos.\n• Pioneiro no desenvolvimento de soluções adaptáveis, agora empregadas em várias indústrias.\n• Proficiente em tecnologias de IA e PLN, incluindo API ChatGPT, IBM Watson e DialogFlow, integrando capacidades conversacionais avançadas em soluções.\n• Impactos horizontais em todos os serviços de frontend por resolver questões críticas de pipeline, melhorando significativamente a eficiência operacional da empresa.\n• Criei ferramentas, padrões e templates que aprimoram a experiência do desenvolvedor, agora adotados por mais de 20 equipes, acelerando a entrega de projetos e promovendo as melhores práticas.\n• Frequentemente utilizei conceitos de estrutura de dados para resolver problemas complexos.\n• Orientei juniores em testes, arquitetura e programação, e ministrei palestras sobre o ecossistema React e melhores práticas.",
                "period": "Maio 2021 ~ PRESENTE | Tempo integral",
                "image": "/assets/icons/about/take-blip-logo.png",
                "imageAlt": "Logotipo da empresa Take Blip.",
                "readMore": false
            },
            {
                "name": "Essencial Gestão Pública",
                "position": "Desenvolvedor Full Stack",
                "stack": "Typescript | ReactJS | Java | Spring Boot | MySql | Docker",
                "description": "• Liderei a refatoração de frontends legados para Micro Frontends usando NodeJS, React e Typescript.\n• Modernizei práticas de backend com Java, Spring Boot e Docker, aprimorando o registro de erros e a solução proativa de problemas.\n• Alcançei uma redução de 100% nos erros de frontend e entrega de recursos 80% mais rápida.\n• Cultivei uma cultura de desenvolvimento orientado por testes, resultando em 40% de cobertura de código a partir de zero.",
                "period": "Outubro 2021 ~ PRESENTE | Freelance",
                "image": "/assets/icons/about/essencial-gestao-publica-logo.png",
                "imageAlt": "Logotipo da empresa Essencial Gestão Pública.",
                "readMore": false
            },
            {
                "name": "Freelancer",
                "position": "Desenvolvedor Javascript",
                "stack": "Node.JS | Express.JS | Electron.JS | Firebase",
                "description": "• Desenvolvi softwares personalizados para desktops, otimizando processos de negócios locais.\n• Criei sistemas simples e robustos usando NodeJS, ExpressJS e Firebase, agora lidando com milhares de registros diariamente.",
                "period": "2020 | Freelance",
                "image": "/assets/icons/home/brain-256px.png",
                "imageAlt": "Um desenho de um cérebro.",
                "readMore": false
            }
        ]
    },
    "education": {
        "title": "education",
        "items": [
            {
                "name": "Mackenzie",
                "course": "Análise e Desenvolvimento de Sistemas",
                "description": "• Fundamentos de ciência da computação: Cálculo, Algoritmos, Hardware, Estruturas de Dados.",
                "period": "2019 ~ PRESENTE",
                "image": "/assets/icons/about/mackenzie-logo.png",
                "imageAlt": "mackenzie logo",
                "readMore": false
            }
        ]
    }
}
